docs/report.org
#+title: SIGPwny ECE 297 Project
#+options: toc:nil
#+author:
#+LATEX_HEADER:\author{Project By\\ Aditya Nebhrajani\\ \texttt{avn5} \and Overseen By\\ Thomas Quig\\ \and Submitted To\\ Professor Miller}
#+date: Fall 2021
#+LATEX_HEADER: \usepackage{parskip}
#+LATEX_HEADER:\usepackage[backend=bibtex, style=nature]{biblatex}
#+LATEX_HEADER:\addbibresource{report.bib}
#+latex_header: \setminted{linenos=true, breaklines=true, breakanywhere=true}

#+begin_center
[[https://github.com/nebhrajani-a/taCTF][=https://github.com/nebhrajani-a/taCTF=]]
#+end_center

* Abstract
This report describes an "automatic" tool for implementing
a side-channel timing-style attack on compiled binaries. Timing
attacks are often difficult to design around, especially since it may
cause poorer performance. Timing attacks are among the most successful
forms of side-channel attack, with Meltdown\cite{meltdown} and
Spectre\cite{spectre} as recent examples, and initial implementations
of Unix =login= as classical examples. The tool described by this
report specifically focuses on a simpler kind of side channel: it uses
Valgrind to count the number of instructions executed by a string
comparison function for various inputs, and uses the result to predict
the string.

* Background

** Problem Statement
String comparison is a basic operation in many cryptographic
applications. Consider a C function written the following way\cite{wiki}:

#+BEGIN_SRC c
 bool insecureStringCompare(const void *a, const void *b, size_t length) {
  const char *ca = a, *cb = b;
  for (size_t i = 0; i < length; i++)
    if (ca[i] != cb[i])
      return false;
  return true;
}
#+END_SRC

When input strings =a= and =b= are identical, all is well. However, if
the strings differ at any character, the function instantly returns,
breaking the src_c[:exports code]{for} loop. This makes sense for
efficiency, since we're not wasting time checking the equivalence of
two strings that are obviously unequal. However, this gives us a way to
"brute-force" one of the strings if the other is held constant: we can
simply try every ASCII character, and if the src_c[:exports code]{for}
loop isn't broken, the current character must be the correct one.

Of course, the natural question is, how can we tell from the execution
of a binary file whether the src_c[:exports code]{for} loop has been
terminated or not? This is done by counting the number of assembly
instructions executed: more instructions would imply that the
function did not terminate: so we must have the right character.

Preventing such an attack requires that the function check both
strings all the way through, regardless of whether they stop matching
at a certain character. A patched function is thus:

#+BEGIN_SRC c
 bool constantTimeStringCompare(const void *a, const void *b, size_t length) {
  const char *ca = a, *cb = b;
  bool result = true;
  for (size_t i = 0; i < length; i++)
    result &= ca[i] == cb[i];
  return result;
}
#+END_SRC

This entirely removes our side channel. Another way that timing
attacks are prevented is by making the program sleep for small and
random amounts of time, or perform some other random operations. This
throws off any tools like ours.

** Current Tools
Given that such a vulnerability is popular among CTF-style reverse
engineering challenges, a tool similar in function to the one we detail
does exist: PinCTF\cite{pinctf}. However, it uses Intel's PIN to count
instructions rather than Valgrind. Intel PIN is notoriously difficult
to install and get working, and has a habit of littering any directory
it's called in with =inscount.out= files that need to be removed. The
author of this paper could only install PIN on a Garuda Linux virtual
machine, but PinCTF still did not run correctly; which is much more
PIN's fault than the tool's. PinCTF's open GitHub issues are also a
result of PIN's weird behavior. Moreover, our tool's functionality is
a superset of PinCTF's, with automatic length computation and more
options.

In essence, there's a need for a better instruction counting tool
that's plug and play. Valgrind is an excellent instrumentation
framework, and its tool =callgrind= has an instruction counting
function built-in.[fn:1] From testing with multiple binaries, it seems that
this is equally as useful for our purposes as Intel's PIN. While the
absolute value of instructions counted differs between Valgrind and
PIN, the deltas, which are what we care about, agree.

Our tool is called "taCTF" (pronounced either "tÄ-CTF" or with each
letter said out loud). The language chosen is Python. Haskell was
considered[fn:2], but ultimately dropped due to considerations of ease of
contribution.

The goal while writing this tool was that there should be no
=requirements.txt= or /any/ environment setup required beyond
installing Python 3 and Valgrind (which can be done in a single
command on any good Linux distributions.[fn:3]), and running the
script. We also try to provide some options that make life easier when
doing attacks of this sort, such as reverse-order attacking, known
string prefixes, etc.

* Methodology

Our job is to run Valgrind's =callgrind= on the binary with various
inputs, parse the output for the instruction count, then use the
instruction count data to reconstruct the string.

